irvynX/ESP32/controladorCuarto/src/main.cpp
//---------------------------------- verificacion de los mensajes ---------------------------
void VerificarMensaje(String Mensaje)
{
  int mensaje;
  int cont = 0;
  String temp;
  if (Mensaje.indexOf("?foco") >= 0){
    if(Mensaje.indexOf("foco=1") >= 0){
      estadoRele = 1;
      Serial.println("rele encendido");
    }else{
      estadoRele = 0;
      Serial.println("rele apagado");
    }
  }else if(Mensaje.indexOf("?tiraE") >= 0){
    if(Mensaje.indexOf("tiraE=1") >= 0){
      Serial.println("tira E: encendido");
      encenderE = 1;
    }else{
      encenderE = 0;
      Serial.println("tira E: apagado");
    }

    if(Mensaje.indexOf("efecto=0") >= 0){
      estadoE = 0;
      Serial.println("efecto 0");
    }else if(Mensaje.indexOf("efecto=1") >= 0){
      estadoE = 1;
      Serial.println("efecto 1");
    }else if(Mensaje.indexOf("efecto=2") >= 0){
      estadoE = 2;
      Serial.println("efecto 2");
    }else if(Mensaje.indexOf("efecto=3") >= 0){
      estadoE = 3;
      Serial.println("efecto 3");
    }else{
      estadoE = 4;
      Serial.println("efecto 4");
    }

    mensaje = Mensaje.indexOf("color=");
    temp = Mensaje[mensaje + 9];
    temp += Mensaje[mensaje + 10];
    temp += Mensaje[mensaje + 11];
    temp += Mensaje[mensaje + 12];
    temp += Mensaje[mensaje + 13];
    temp += Mensaje[mensaje + 14];
    Serial.println(temp);
    hexaRGB(temp);
    rojoE = rojoTemp;
    verdeE = verdeTemp;
    azulE = azulTemp;

    mensaje = Mensaje.indexOf("brillo=");
    temp = Mensaje[mensaje + 7];
    if(Mensaje[mensaje + 8] != '&'){
      temp += Mensaje[mensaje + 8];
    }
    if(Mensaje[mensaje + 9] != '&'){
      temp += Mensaje[mensaje + 9];
    }
    Serial.println(temp);
    brilloE = temp.toInt();
  }else if(Mensaje.indexOf("?tiraG") >= 0){
    if(Mensaje.indexOf("tiraG=1") >= 0){
      encenderG = 1;
      Serial.println("tira G: encendida");
    }else{
      encenderG = 0;
      Serial.println("tira G: apagado");
    }

    if(Mensaje.indexOf("efecto=0") >= 0){
      estadoG = 0;
      Serial.println("efecto 0");
    }else if(Mensaje.indexOf("efecto=1") >= 0){
      estadoG = 1;
      Serial.println("efecto 1");
    }else if(Mensaje.indexOf("efecto=2") >= 0){
      estadoG = 2;
      Serial.println("efecto 2");
    }else if(Mensaje.indexOf("efecto=3") >= 0){
      estadoG = 3;
      Serial.println("efecto 3");
    }else{
      estadoG = 4;
      Serial.println("efecto 4");
    }

    mensaje = Mensaje.indexOf("color=");
    temp = Mensaje[mensaje + 9];
    temp += Mensaje[mensaje + 10];
    temp += Mensaje[mensaje + 11];
    temp += Mensaje[mensaje + 12];
    temp += Mensaje[mensaje + 13];
    temp += Mensaje[mensaje + 14];
    Serial.println(temp);
    hexaRGB(temp);
    rojoG = rojoTemp;
    verdeG = verdeTemp;
    azulG = azulTemp;

    mensaje = Mensaje.indexOf("brillo=");
    temp = Mensaje[mensaje + 7];
    if(Mensaje[mensaje + 8] != '&'){
      temp += Mensaje[mensaje + 8];
    }
    if(Mensaje[mensaje + 9] != '&'){
      temp += Mensaje[mensaje + 9];
    }
    Serial.println(temp);
    brilloG = temp.toInt();
  }else if(Mensaje.indexOf("?micro") >= 0){
    mensaje = Mensaje.indexOf("micro=");
    cont = 0;
    temp = "";
    while(Mensaje[mensaje + 6 + cont] != '&'){
      temp += Mensaje[mensaje + 6 + cont];
      cont++;
    }
    Serial.println("micro: " + temp);
    mulMicrofono = temp.toInt();

    mensaje = Mensaje.indexOf("hora=");
    cont = 0;
    temp = "";
    while(Mensaje[mensaje + 5 + cont] != '&'){
      temp += Mensaje[mensaje + 5 + cont];
      cont++;
    }
    Serial.println("hora: " + temp);
    horaSumar = temp.toInt();

    mensaje = Mensaje.indexOf("minuto=");
    cont = 0;
    temp = "";
    while(Mensaje[mensaje + 7 + cont] != '&'){
      temp += Mensaje[mensaje + 7 + cont];
      cont++;
    }
    Serial.println("minuto: " + temp);
    minSumar = temp.toInt();

  }
}

//------------------------------------------loop----------------------------------

void loop(){
  WiFiClient cliente = servidor.available();
  // usuario en la pagina web
  if (cliente)
  {
    Serial.println("Nuevo Cliente");
    TiempoActual = millis();
    TiempoAnterior = millis();
    String LineaActual = "";

    while (cliente.connected() && (TiempoActual - TiempoAnterior <= TiempoCancelacion))
    {
      if (cliente.available())
      {
        TiempoActual = millis();
        char Letra = cliente.read();
        if (Letra == '\n')
        {
          if (LineaActual.length() == 0)
          {
            ResponderCliente(cliente); // <---------------------------falta
            break;
          }
          else
          {
            VerificarMensaje(LineaActual); // <---------------------------falta
            LineaActual = "";
          }
        }
        else if (Letra != '\r')
        {
          LineaActual += Letra;
        }
      }
    }

    cliente.stop();
    Serial.println("Cliente Desconectado");
    Serial.println();
  }

  // no hay usuarios en la red
  // tira gabinete
  if (encenderG == 0)
  {
    pixelsG.clear();
    pixelsG.show();
  }
  else if (estadoG == 0 && encenderG == 1)
  {
    pixelsG.fill(pixelsG.Color(rojoG, verdeG, azulG), 0, numLeds);
    pixelsG.setBrightness(brilloG);
    pixelsG.show();
  }
  else if (estadoG == 1 && encenderG == 1)
  {
    // metodo de musica
    pixelsG.setBrightness(brilloG);
    efectoMusica(pixelsG, 1); 
  }
  else if (estadoG == 2 && encenderG == 1)
  {
    // metodo llenar tira leds
    pixelsG.setBrightness(brilloG);
    efectoMusica(pixelsG, 2);
  }
  else if (estadoG == 3 && encenderG == 1)
  {
    // metodo llenar tira leds
    pixelsG.setBrightness(brilloG);
    llenarTira(pixelsG,pixelsE);
  }
  else if (estadoG == 4 && encenderG == 1)
  {
    // encender y apagar
    repirar();
  }

  // tira escritorio
  if (encenderE == 0)
  {
    pixelsE.clear();
    pixelsE.show();
  }
  else if (estadoE == 0 && encenderE == 1)
  {
    pixelsE.fill(pixelsE.Color(rojoE, verdeE, azulE), 0, numLeds);
    pixelsE.setBrightness(brilloE);
    pixelsE.show();
  }
  else if (estadoE == 1 && encenderE == 1)
  {
    // metodo de musica
    pixelsE.setBrightness(brilloE);
    efectoMusica(pixelsE, 3);
  }
  else if (estadoE == 2 && encenderE == 1)
  {
    // metodo llenar tira leds
    pixelsE.setBrightness(brilloE);
    efectoMusica(pixelsE, 4);
  }
  else if (estadoE == 3 && encenderE == 1)
  {
    // metodo llenar tira leds
    pixelsE.setBrightness(brilloE);
    llenarTira(pixelsG,pixelsE);
  }
  else if (estadoE == 4 && encenderE == 1)
  {
    repirar();
  }

