irvynX/ESP32/controladorCuarto/src/main.cpp
  // rele
  if (estadoRele == 0)
  {
    apagarRele();
  }
  else
  {
    encenderRele();
  }

  // leer estado de los botones
  int botonEstado1 = digitalRead(boton1); // encender y apagar tira 1 x
  int botonEstado2 = digitalRead(boton2); // encender y apagar tira 2 x
  int botonEstado3 = digitalRead(boton3); // encender y apagar rele x
  int botonEstado4 = digitalRead(boton4); // encender todo x
  int botonEstado5 = digitalRead(boton5); // cambiar efecto 2 x
  int botonEstado6 = digitalRead(boton6); // cambiar efecto 1 x 
  int botonEstado7 = digitalRead(boton7); // apagar todo x

  // realizar acciones en función del estado de los botones
  if (botonEstado1 == HIGH)
  {
    encedeApagarTiraG();
    Serial.println("Botón tira 1!");
    delay(500);
  }

  if (botonEstado2 == HIGH)
  {
    encedeApagarTiraE();
    Serial.println("Botón tira 2!");
    delay(500);
  }

  if (botonEstado3 == HIGH)
  {
    encedeApagarFoco();
    Serial.println("Botón rele!");
    delay(500);
  }

  if (botonEstado4 == HIGH)
  {
    encenderG = 1;
    encenderE = 1;
    estadoRele = 1;
    Serial.println("Botón encender todo!");
    delay(500);
  }

  if (botonEstado5 == HIGH)
  {
    cambiarEfectoE();
    Serial.println("Botón cambiar efecto tira 2!");
    delay(500);
  }

  if (botonEstado6 == HIGH)
  {
    cambiarEfectoG();
    Serial.println("Botón cambiar efecto tira 1!");
    delay(500);
  }

  if (botonEstado7 == HIGH)
  {
    encenderG = 0;
    encenderE = 0;
    estadoRele = 0;
    Serial.println("Botón apagar todo!");
    delay(500);
  }
}
